results/cpu-vs-latency4/memcached/12-3/nsl203.out
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  30 secs]  0 threads:     2780075 ops,   90812 (avg:   92664) ops/sec, 3.42MB/sec (avg: 3.49MB/sec),  2.11 (avg:  2.07) msec latency

12        Threads
16        Connections per thread
30        Seconds
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets        8154.98          ---          ---      2.07700       604.49
Gets       81519.28      9196.78     72322.50      2.06800      2858.54
Totals     89674.26      9196.78     72322.50      2.06800      3463.02


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.000     67.20789
SET       2.000     90.04865
SET       3.000     91.98798
SET       4.000     92.09121
SET       5.000     92.71062
SET       6.000     99.19350
SET       7.000     99.99842
SET       8.000    100.00000
---
GET       0.093      0.00004
GET       0.098      0.00008
GET       0.110      0.00028
GET       0.120      0.00032
GET       0.130      0.00036
GET       0.140      0.00083
GET       0.150      0.00142
GET       0.160      0.00214
GET       0.170      0.00317
GET       0.180      0.00415
GET       0.190      0.00538
GET       0.200      0.00700
GET       0.210      0.00831
GET       0.220      0.00977
GET       0.230      0.01112
GET       0.240      0.01278
GET       0.250      0.01432
GET       0.260      0.01571
GET       0.270      0.01705
GET       0.280      0.01792
GET       0.290      0.01883
GET       0.300      0.02014
GET       0.310      0.02125
GET       0.320      0.02232
GET       0.330      0.02350
GET       0.340      0.02453
GET       0.350      0.02552
GET       0.360      0.02631
GET       0.370      0.02742
GET       0.380      0.02813
GET       0.390      0.02944
GET       0.400      0.03027
GET       0.410      0.03118
GET       0.420      0.03209
GET       0.430      0.03268
GET       0.440      0.03348
GET       0.450      0.03407
GET       0.460      0.03458
GET       0.470      0.03506
GET       0.480      0.03537
GET       0.490      0.03613
GET       0.500      0.03668
GET       0.510      0.03712
GET       0.520      0.03747
GET       0.530      0.03814
GET       0.540      0.03846
GET       0.550      0.03913
GET       0.560      0.03953
GET       0.570      0.04016
GET       0.580      0.04095
GET       0.590      0.04206
GET       0.600      0.04293
GET       0.610      0.04380
GET       0.620      0.04432
GET       0.630      0.04475
GET       0.640      0.04546
GET       0.650      0.04606
GET       0.660      0.04709
GET       0.670      0.04776
GET       0.680      0.04847
GET       0.690      0.04914
GET       0.700      0.04994
GET       0.710      0.05037
GET       0.720      0.05120
GET       0.730      0.05180
GET       0.740      0.05286
GET       0.750      0.05413
GET       0.760      0.05528
GET       0.770      0.05682
GET       0.780      0.05856
GET       0.790      0.06086
GET       0.800      0.06303
GET       0.810      0.06568
GET       0.820      0.06834
GET       0.830      0.07174
GET       0.840      0.07498
GET       0.850      0.07878
GET       0.860      0.08301
GET       0.870      0.08757
GET       0.880      0.09235
GET       0.890      0.09793
GET       0.900      0.10391
GET       0.910      0.11071
GET       0.920      0.12045
GET       0.930      0.13014
GET       0.940      0.14209
GET       0.950      0.15653
GET       0.960      0.17319
GET       0.970      0.19369
GET       0.980      0.21616
GET       0.990      0.24422
GET       1.000      0.62958
GET       1.100     18.90074
GET       1.200     34.94238
GET       1.300     36.29214
GET       1.400     36.64961
GET       1.500     39.54623
GET       1.600     58.86672
GET       1.700     66.17429
GET       1.800     67.11013
GET       1.900     67.27394
GET       2.000     67.32324
GET       2.100     67.40554
GET       2.200     68.20115
GET       2.300     70.61970
GET       2.400     72.72990
GET       2.500     79.73813
GET       2.600     86.26890
GET       2.700     88.69853
GET       2.800     89.70583
GET       2.900     90.01557
GET       3.000     90.09483
GET       3.100     90.34945
GET       3.200     91.26800
GET       3.300     91.81385
GET       3.400     91.94157
GET       3.500     91.97074
GET       3.600     91.97802
GET       3.700     91.97972
GET       3.800     91.98118
GET       3.900     91.98308
GET       4.000     91.98371
GET       4.100     91.98427
GET       4.200     91.98494
GET       4.300     91.98680
GET       4.400     91.98874
GET       4.500     91.98973
GET       4.600     91.99222
GET       4.700     91.99459
GET       4.800     92.00077
GET       4.900     92.04433
GET       5.000     92.16660
GET       5.100     92.32250
GET       5.200     92.41497
GET       5.300     92.47191
GET       5.400     92.50408
GET       5.500     92.51480
GET       5.600     92.52307
GET       5.700     92.53637
GET       5.800     92.56466
GET       5.900     92.65571
GET       6.000     92.89901
GET       6.100     93.43921
GET       6.200     94.33979
GET       6.300     95.50864
GET       6.400     96.74501
GET       6.500     97.80723
GET       6.600     98.52690
GET       6.700     98.96647
GET       6.800     99.19161
GET       6.900     99.31526
GET       7.000     99.40540
GET       7.100     99.49400
GET       7.200     99.58880
GET       7.300     99.69821
GET       7.400     99.79955
GET       7.500     99.88149
GET       7.600     99.94041
GET       7.700     99.97333
GET       7.800     99.98916
GET       7.900     99.99652
GET       8.000     99.99929
GET       8.100     99.99953
GET       8.200     99.99956
GET       8.300     99.99972
GET       8.400     99.99976
GET       9.700     99.99984
GET      11.000    100.00000